swe-modified-2025/openfoam/example_4_1_2d_dam_break/perfect_slip/dambreak_Ny320/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
	    type		zeroGradient;
    };

    outlet
    {
        type        zeroGradient;
    };

    wall
    {
        type            zeroGradient;
    };

    atmosphere
    {
        type            prghTotalPressure;
        p0              $internalField;
    }
}


// ************************************************************************* //
