swe-modified-2025/openfoam/example_4_1_2d_dam_break/perfect_slip/dambreak_Ny320/Allrun
#!/bin/bash
set -eo pipefail

cd "$(dirname "$0")"
. "$WM_PROJECT_DIR/bin/tools/RunFunctions"

runApplication blockMesh
runApplication setFields
runApplication decomposePar -force
runParallel "$(getApplication)"

#------------------------------------------------------------------------------
